#RMS Titanic Survival Prediction - Machine Learning from Disaster

In [ ]:
#importing necessary modules
%matplotlib inline
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import tree, preprocessing
import sklearn.ensemble as ske

In [2]:
train_df = pd.read_csv('train.csv', index_col=None, na_values=['NA'])

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
train_df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [5]:
train_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [6]:
train_df['Age'] = train_df['Age'].fillna(train_df['Age'].mean())

In [7]:
train_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            891
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [8]:
train_df = train_df.drop(['Cabin'], axis=1)
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [11]:
def preprocess_df(df):
    processed_df = df.copy()
    le = preprocessing.LabelEncoder()
    processed_df.Sex = le.fit_transform(processed_df.Sex)
    processed_df = processed_df.drop(['Name', 'Ticket', 'Embarked'],axis=1)
    return processed_df

In [12]:
pr_train_df = preprocess_df(train_df)

In [13]:
pr_train_df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Fare           False
dtype: bool

In [14]:
pr_train_df.count()

PassengerId    891
Survived       891
Pclass         891
Sex            891
Age            891
SibSp          891
Parch          891
Fare           891
dtype: int64

In [30]:
pr_train_df.shape

(891, 8)

In [15]:
X = pr_train_df.drop(['Survived'], axis=1).values
y = pr_train_df['Survived'].values

In [16]:
from sklearn import cross_validation
X_train, X_test, y_train, y_test = cross_validation.train_test_split(X, y, test_size=0.2)

C:\ProgramData\Anaconda3\lib\site-packages\sklearn\cross_validation.py:44: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [17]:
clf = tree.DecisionTreeClassifier(max_depth=10)
clf.fit(X_train, y_train)
clf.score(X_test, y_test)

0.77653631284916202

In [18]:
rf = ske.RandomForestClassifier(n_estimators=50)
rf.fit(X_train, y_train)
rf.score(X_test, y_test)

0.81564245810055869

Model testing on test data

In [19]:
test_df = pd.read_csv('test.csv', index_col=None, na_values=['NA'])
test_df.count()

PassengerId    418
Pclass         418
Name           418
Sex            418
Age            332
SibSp          418
Parch          418
Ticket         418
Fare           417
Cabin           91
Embarked       418
dtype: int64

In [20]:
test_df = test_df.drop(['Cabin'], axis=1)
test_df['Age'] = test_df['Age'].fillna(test_df['Age'].mean())
test_df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,S

In [21]:
pr_test_df = preprocess_df(test_df)
pr_test_df.count()

PassengerId    418
Pclass         418
Sex            418
Age            418
SibSp          418
Parch          418
Fare           417
dtype: int64

In [22]:
pr_test_df['Survived'] = pd.Series(dtype=int, index=pr_test_df.index)
pr_test_df.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Survived
0          892       3    1  34.5      0      0   7.8292       NaN
1          893       3    0  47.0      1      0   7.0000       NaN
2          894       2    1  62.0      0      0   9.6875       NaN
3          895       3    1  27.0      0      0   8.6625       NaN
4          896       3    0  22.0      1      1  12.2875       NaN

In [23]:
pr_test_df['Survived'] = pr_test_df['Survived'].fillna(0)

In [24]:
pr_test_df.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Survived
0          892       3    1  34.5      0      0   7.8292       0.0
1          893       3    0  47.0      1      0   7.0000       0.0
2          894       2    1  62.0      0      0   9.6875       0.0
3          895       3    1  27.0      0      0   8.6625       0.0
4          896       3    0  22.0      1      1  12.2875       0.0

In [27]:
pr_test_df['Fare'] = pr_test_df['Fare'].fillna(35.627188)
pr_test_df.head()

   PassengerId  Pclass  Sex   Age  SibSp  Parch     Fare  Survived
0          892       3    1  34.5      0      0   7.8292       0.0
1          893       3    0  47.0      1      0   7.0000       0.0
2          894       2    1  62.0      0      0   9.6875       0.0
3          895       3    1  27.0      0      0   8.6625       0.0
4          896       3    0  22.0      1      1  12.2875       0.0

In [28]:
pr_test_df.isnull().any()

PassengerId    False
Pclass         False
Sex            False
Age            False
SibSp          False
Parch          False
Fare           False
Survived       False
dtype: bool

In [31]:
pr_test_df.shape

(418, 8)

In [43]:
#this has to be deleted
X_test = pr_test_df.drop(['Survived'], axis=1).values
y_test = pr_test_df['Survived'].values

In [60]:
test_features = pr_test_df[['PassengerId', 'Pclass', 'Sex', 'Age', 'SibSp', 'Fare', 'Survived']].values
pred = rf.predict(test_features)

In [61]:
# Using Random Forests
ids = pr_test_df['PassengerId']
#predictions = clf.predict(pr_test_df.drop('PassengerId', axis=1))
pred = rf.predict(test_features)

output = pd.DataFrame({ 'PassengerId' : ids, 'Survived': pred })
output.to_csv('rf_new.csv', index = False)

In [62]:
output.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0